<?php

namespace AvtoDev\IDEntity\Tests\Types;

use Illuminate\Support\Str;
use AvtoDev\IDEntity\IDEntity;
use AvtoDev\IDEntity\Types\IDEntityGrz;

/**
 * Class IDEntityGrzTest.
 */
class IDEntityGrzTest extends AbstractIDEntityTestCase
{
    /**
     * {@inheritdoc}
     */
    public function testGetType()
    {
        $this->assertEquals(IDEntity::ID_TYPE_GRZ, $this->instance->getType());
    }

    /**
     * {@inheritdoc}
     */
    public function testIsValid()
    {
        $valid = [
            // Валидные номера прицепов
            'АА0001177',
            'КК3921090',
            'УК868026',
            'КС135101',

            // И эти тоже валидные
            '0001АА77',
            '3922АА190',
            '8688АА26',

            'А825МС716',
            'Р392КК190',
            'С731НХ197',
            'Е750МО750',
            'М396СХ46',
            'А137НО89',
            'К898КМ40',
            'О772ТХ197',
            'В771ЕК126',
            'Х894СВ59',
            'Е373ТА73',
            'А777АА77',
            'О704КО190',
            'У868УК26',
            'М824РН78',
            'Т149ОЕ190',
            'Т293ТА178',
            'О476ЕЕ750',
            'В168ТС190',
            'У460УА77',
            'Т258СА77',
            'С475РУ777',
            'Р295ЕЕ178',
            'Х918УУ116',
            'Х116РЕ96',
            'У888ЕК99',
            'О292ОМ77',
            'С989ЕР72',
            'К324МУ750',
            'Е228РХ33',
            'О166РУ174',
            'Н492ТН197',
            'К206МХ32',
            'Р515ЕР19',
            'Н416ТЕ161',
            'У477ЕМ178',
            'Н090РН777',
            'В399УН777',
            'Е986НХ199',
            'М441ЕЕ73',
            'Р842СН777',
            'У914ВХ123',
            'Р181СК161',
            'У371ВН142',
            'У752НХ178',
            'А548ВР750',
            'Н580ХС38',
            'Е427ЕВ190',
            'О386АА40',
            'С061ОУ777',
            'Р295КА102',
            'Р239УЕ777',
            'О461ОВ750',
            'К005АВ77',
            'Е029ХВ70',
            'У956УС777',
            'А528КТ37',
            'Р602ВС86',
            'Р048ОА750',
            'Е251ВК82',
            'Е966РА777',
            'Н340АХ199',
            'Т555СН42',
            'К052ОУ178',
            'М333МВ161',
            'А028ЕУ178',
            'С326ХО199',
            'С976РТ98',
            'Н388ЕУ750',
            'М770РВ161',
            'М828МР02',
            'О377ЕТ750',
            'Е697ХС163',
            'Т612ХХ47',
            'В750КО777',
            'Т085КР123',
            'У700КХ61',
            'К988СС82',
            'Т039КР60',
            'Е751УХ197',
            'С572ЕУ777',
            'Е393МН33',
            'С552ВХ102',
            'Н327СМ777',
            'А284АР777',
            'У606КЕ33',
            'У828ХК47',
            'О590ТТ98',
            'У092СУ98',
            'О168РЕ197',
            'Т900ММ77',
            'Т462КО750',
            'Р012МА34',
            'У188РУ174',
            'В164ОЕ190',
            'О832ВТ31',
            'Е237ОА77',
            'А098АА99',
            'Е105ТУ777',
            'Е683СВ777',
            'М010ЕЕ26',
            'В199ХН199',

            // ГРЗ-номера такси
            'МС825716',
            'КК392190',
            'НХ731197',
            'МО750750',
            'СХ39646',
            'НО13789',
            'КМ89840',
            'ТХ772197',
            'ЕК771126',
            'СВ89459',
            'ТА37373',
            'АА77777',
            'КО704190',
            'УК86826',
            'РН82478',
            'ОЕ149190',
            'ТА293178',
            'ЕЕ476750',
            'ТС168190',
        ];

        foreach ($valid as $value) {
            $this->assertTrue($this->instance->setValue($value)->isValid(), sprintf('GRZ: "%s"', $value));
        }

        $this->assertFalse($this->instance->setValue('TSMEYB21S00610448')->isValid());
        $this->assertFalse($this->instance->setValue('LN130-0128818')->isValid());
    }

    /**
     * Тест метода получения кода региона ГРЗ номера.
     *
     * @return void
     */
    public function testGetRegionCode()
    {
        $expects = [
            // Номера прицепов
            'АА0001177' => 177,
            'КК3921090' => 90,
            'УК868026'  => 26,
            'КС135101'  => 1,
            '0001АА77'  => 77,
            '3922АА190' => 190,
            '8688АА26'  => 26,
            '8688АА1'   => 1,
            '8688АА01'  => 1,
            '8688АА001' => 1,
            '8688АА011' => 11,
            '8688АА11'  => 11,

            'А825МС716' => 716,
            'Р392КК190' => 190,
            'С731НХ197' => 197,
            'Е750МО750' => 750,
            'М396СХ46'  => 46,
            'А137НО89'  => 89,
            'К898КМ40'  => 40,
            'О772ТХ197' => 197,
            'В771ЕК126' => 126,
            'Х894СВ59'  => 59,
            'Е373ТА73'  => 73,
            'А777АА77'  => 77,
            'О704КО190' => 190,
            'У868УК26'  => 26,
            'М824РН78'  => 78,
            'Т149ОЕ190' => 190,
            'Т293ТА178' => 178,
            'О476ЕЕ750' => 750,
            'В168ТС190' => 190,
            'У460УА77'  => 77,
            'Т258СА77'  => 77,
            'С475РУ777' => 777,
            'Р295ЕЕ178' => 178,
            'Х918УУ116' => 116,
            'Х116РЕ96'  => 96,
            'У888ЕК99'  => 99,
            'О292ОМ77'  => 77,
            'С989ЕР72'  => 72,
            'К324МУ750' => 750,
            'Е228РХ33'  => 33,
            'О166РУ174' => 174,
            'Н492ТН197' => 197,
            'К206МХ32'  => 32,
            'Р515ЕР19'  => 19,
            'Н416ТЕ161' => 161,
            'У477ЕМ178' => 178,
            'Н090РН777' => 777,
            'В399УН777' => 777,
            'Е986НХ199' => 199,
            'М441ЕЕ73'  => 73,
            'Р842СН777' => 777,
            'У914ВХ123' => 123,
            'Р181СК161' => 161,
            'У371ВН142' => 142,
            'У752НХ178' => 178,
            'А548ВР750' => 750,
            'Н580ХС38'  => 38,
            'Е427ЕВ190' => 190,
            'О386АА40'  => 40,
            'С061ОУ777' => 777,
            'Р295КА102' => 102,
            'Р239УЕ777' => 777,
            'О461ОВ750' => 750,
            'К005АВ77'  => 77,
            'Е029ХВ70'  => 70,
            'У956УС777' => 777,
            'А528КТ37'  => 37,
            'Р602ВС86'  => 86,
            'Р048ОА750' => 750,
            'Е251ВК82'  => 82,
            'Е966РА777' => 777,
            'Н340АХ199' => 199,
            'Т555СН42'  => 42,
            'К052ОУ178' => 178,
            'М333МВ161' => 161,
            'А028ЕУ178' => 178,
            'С326ХО199' => 199,
            'С976РТ98'  => 98,
            'Н388ЕУ750' => 750,
            'М770РВ161' => 161,
            'М828МР02'  => 2,
            'О377ЕТ750' => 750,
            'Е697ХС163' => 163,
            'Т612ХХ47'  => 47,
            'В750КО777' => 777,
            'Т085КР123' => 123,
            'У700КХ61'  => 61,
            'К988СС82'  => 82,
            'Т039КР60'  => 60,
            'Е751УХ197' => 197,
            'С572ЕУ777' => 777,
            'Е393МН33'  => 33,
            'С552ВХ102' => 102,
            'Н327СМ777' => 777,
            'А284АР777' => 777,
            'У606КЕ33'  => 33,
            'У828ХК47'  => 47,
            'О590ТТ98'  => 98,
            'У092СУ98'  => 98,
            'О168РЕ197' => 197,
            'Т900ММ77'  => 77,
            'Т462КО750' => 750,
            'Р012МА34'  => 34,
            'У188РУ174' => 174,
            'В164ОЕ190' => 190,
            'О832ВТ31'  => 31,
            'Е237ОА77'  => 77,
            'А098АА99'  => 99,
            'Е105ТУ777' => 777,
            'Е683СВ777' => 777,
            'М010ЕЕ26'  => 26,
            'В199ХН199' => 199,

            'В001ХН001' => 1,
            'В001ХН01'  => 1,
            'В001ХН1'   => 1,
            'В001ХН004' => 4,
            'В001ХН04'  => 4,
            'В001ХН4'   => 4,
            'В001ХН02'  => 2,
            'В001ХН102' => 102,
            'В001ХН03'  => 3,
            'В001ХН3'   => 3,
            'В001ХН10'  => 10,
            'В001ХН010' => 10,
            'В001ХН011' => 11,
            'В001ХН11'  => 11,
            'В001ХН111' => 111,
            'В001ХН21'  => 21,
            'В001ХН121' => 121,
            'В001ХН24'  => 24,
            'В001ХН124' => 124,
            'В001ХН84'  => 84,
            'В001ХН184' => 184,

            // ГРЗ-номера такси
            'МС825716'  => 716,
            'КК392190'  => 190,
            'НХ731197'  => 197,
            'МО750750'  => 750,
            'СХ39646'   => 46,
            'НО13789'   => 89,
            'КМ89840'   => 40,
            'ТХ772197'  => 197,
            'ЕК771126'  => 126,
            'СВ89459'   => 59,
            'ТА37373'   => 73,
            'АА77777'   => 77,
            'КО704190'  => 190,
            'УК86826'   => 26,
            'РН82478'   => 78,
            'ОЕ149190'  => 190,
            'ТА293178'  => 178,
            'ЕЕ476750'  => 750,
            'ТС168190'  => 190,

            'А098АА'    => null,
            '123А098АА' => null,
            'foo bar'   => null,
        ];

        /** @var IDEntityGrz $instance */
        $instance = $this->instance;

        foreach ($expects as $what => $with) {
            $this->assertEquals(
                $with, $instance->setValue($what)->getRegionCode(), sprintf('"%s" !== "%s"', $what, $with)
            );
        }
    }

    /**
     * Тест метода, возвращающего данные о регионе ГРЗ номера.
     *
     * @return void
     */
    public function testGetRegionData()
    {
        $expects = [
            'КК3921090' => 'RU-MOS',
            'УК868026'  => 'RU-STA',
            'КС135101'  => 'RU-AD',
            '0001АА77'  => 'RU-MOW',
            '3922АА190' => 'RU-MOS',
            '8688АА26'  => 'RU-STA',
            '8688АА1'   => 'RU-AD',
            '8688АА01'  => 'RU-AD',
            '8688АА001' => 'RU-AD',
            '8688АА011' => 'RU-KO',
            '8688АА11'  => 'RU-KO',

            'С552ВХ102' => 'RU-BA',
            'Н327СМ777' => 'RU-MOW',
            'АА0001177' => 'RU-MOW',
            'У606КЕ33'  => 'RU-VLA',
            'У828ХК47'  => 'RU-LEN',
            'О590ТТ98'  => 'RU-SPE',
            'О168РЕ197' => 'RU-MOW',
            'Т900ММ77'  => 'RU-MOW',
            'Т462КО750' => 'RU-MOS',
            'Р012МА34'  => 'RU-VGG',
            'У188РУ174' => 'RU-CHE',
            'В164ОЕ190' => 'RU-MOS',
            'О832ВТ31'  => 'RU-BEL',
            'А098АА99'  => 'RU-MOW',
            'А825МС716' => 'RU-TA',

            // Такси
            'РЕ168197'  => 'RU-MOW',
            'ММ90077'   => 'RU-MOW',
            'КО462750'  => 'RU-MOS',
            'МА01234'   => 'RU-VGG',
            'РУ188174'  => 'RU-CHE',
            'ОЕ164190'  => 'RU-MOS',
            'ВТ83231'   => 'RU-BEL',
            'АА09899'   => 'RU-MOW',
            'МС825716'  => 'RU-TA',
            'КК392190'  => 'RU-MOS',
            'НХ731197'  => 'RU-MOW',
            'МО750750'  => 'RU-MOS',
            'СХ39646'   => 'RU-KRS',
            'НО13789'   => 'RU-YAN',
            'КМ89840'   => 'RU-KLU',
            'ТХ772197'  => 'RU-MOW',
            'ЕК771126'  => 'RU-STA',
            'СВ89459'   => 'RU-PER',
            'ТА37373'   => 'RU-ULY',
            'АА77777'   => 'RU-MOW',
            'КО704190'  => 'RU-MOS',
            'УК86826'   => 'RU-STA',
            'РН82478'   => 'RU-SPE',
            'ОЕ149190'  => 'RU-MOS',
            'ТА293178'  => 'RU-SPE',
            'ЕЕ476750'  => 'RU-MOS',
            'ТС168190'  => 'RU-MOS',
        ];

        /** @var IDEntityGrz $instance */
        $instance = $this->instance;

        foreach ($expects as $what => $with) {
            $this->assertEquals(
                $with, $instance->setValue($what)->getRegionData()->getIso31662(), sprintf('"%s" !== "%s"', $what, $with)
            );
        }

        $fails = [
            'А098АА',
            '123А098АА',
            'foo bar',
        ];

        foreach ($fails as $fail) {
            $this->assertNull($instance->setValue($fail)->getRegionData());
        }
    }

    /**
     * {@inheritdoc}
     */
    public function testNormalize()
    {
        $instance = $this->instance;

        // Из нижнего регистра переведёт в верхний
        $this->assertEquals($valid = $this->getValidValue(), $instance::normalize(Str::lower($this->getValidValue())));

        // Пробелы - успешно триммит
        $this->assertEquals($valid, $instance::normalize(' ' . $this->getValidValue() . ' '));

        // Латиницу заменяет на кириллицу
        $this->assertEquals($valid, $instance::normalize('X123YO96'));

        // Некорректные символы - удаляет
        $this->assertEquals($valid, $instance::normalize('X123 #$^&&&% YO96 '));

        $asserts = [
            'Х123АВ96' => ['Х123АВ96', 'Х123AB96'],
            'Х123ЕК96' => ['Х123ЕК96', 'Х123EK96'],
            'Х123МН96' => ['Х123МН96', 'Х123MH96'],
            'Х123ОР96' => ['Х123ОР96', 'Х123OP96'],
            'Х123СТ96' => ['Х123СТ96', 'Х123CT96'],
            'Х123УХ96' => ['Х123УХ96', 'Х123YX96'],
        ];

        foreach ($asserts as $with => $what) {
            foreach ($what as $item) {
                $this->assertEquals($with, $instance::normalize($item));
            }
        }
    }

    /**
     * {@inheritdoc}
     */
    protected function getClassName()
    {
        return IDEntityGrz::class;
    }

    /**
     * {@inheritdoc}
     */
    protected function getValidValue()
    {
        return 'Х123УО96';
    }
}
